-- made by { @Mouamle }
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] =  "هلاوو99وووات نورت/ي ❤️🙈" 

ws[2] = "هلو" -- msg
rs[2] = "هلاوات 🙈❤️" -- reply

ws[3] = "شلونكم" -- msg
rs[3] = "الحمدلله وانته 🌚🍃" -- reply

ws[4] = "دووم" -- msg 
rs[4] = "يدوم نبضك ❤️🍃" -- reply

ws[5] = "شونك"
rs[5] = "الحمدلله وانته"

ws[6] = "شلونك"
rs[6] = "الحمدلله وانته"

ws[7] = "غنيلي"
rs[7] = " 🙈 احبك اني  🙊 اني احبك 🙉 واتحدى واحد بلبشر مثلي يحبك 🙊"

ws[8] = "شغل المبردة"
rs[8] = " تم تشغيل المبردة بنجاح ❄️"

ws[9] = "طفي المبردة"
rs[9] = "طفيتهه 😒🍃"

ws[10] = "شغل السبلت"
rs[10] = "شغلته 🌚🍃 بس حثلجون معليه ترا "

ws[11] = "مايا خليفه"
rs[11] = " 😂 عيب صايمين"

ws[12] = "فطور"
rs[12] = "واخيراً 😍😍 خل اروح افطر "

ws[13] = "جاسم"
rs[13] = "خير 🌚🍃 "

ws[14] = "بطريق"
rs[14] = " 😕💔 نعم حبي  "

ws[15] = "تخليني"
rs[15] = " 😂 يي امين ابدي "

ws[16] = "زاحف"
rs[16] = "😂🌚 هاي عود انته جبير"

ws[17] = "تركيا"
rs[17] = "😐🍃 فديتهه"

ws[18] = "داعش"
rs[18] = "دي خل يولون 😒❤️"

ws[19] = "الدولة الاسلامية"
rs[19] = "انته داعشي ؟؟ 😒💔"

ws[20] = "سني"
rs[20] = "لتصير طائفي 😒🖐"

ws[21] = "شيعي"
rs[21] = "لتصير طائفي 😕"

ws[22] = "تبادل"
rs[22] = "كافي ملينه 😒😒 ما اريد اتبادل"

ws[23] = "العراقيين"
rs[23] = "احلى ناس ولله 😍🙈"

ws[24] = "من وين"
rs[24] = "شعليك زاحف 😂🔥 "

ws[25] = "هاي"
rs[25] = "هايات 🙈🍷"

ws[26] = "البوت"
rs[26] = "معاجبك ؟ 😕😒🍃"

ws[27] = "البوت واكف"
rs[27] = "لتجذب 😒"

ws[28] = "منو ديحذف رسائلي"
rs[28] = "محد 😐🍃"

ws[29] = "كلاش اوف كلانس"
rs[29] = "تلعبهه ؟ شكد لفلك ؟"

ws[30] = "جوني"
rs[30] = "😂 مأذيك ؟"

ws[31] = "ازحف "
rs[31] = " على اختك ازحف 🌚🍃 "

ws[32] = "محمد"
rs[32] = " شتريد منه ؟ "

ws[33] = "منتظر"
rs[33] = " شتريد منه ؟ "

ws[34] = "شادو"
rs[34] = " شتريد منه ؟ "

ws[35] = "@body4"
rs[35] = "شتريد منه ؟"

ws[37] = "@body76"
rs[37] = " شتريد منه ؟ "

ws[38] = "نضوري"
rs[38] = " شتريد منه ؟ "

ws[39] = "المنصور"
rs[39] = " احلى ناس ولله "

ws[40] = "المدرسه"
rs[40] = " 😒🍃 الله لا يراوينه "

ws[41] = "تحبني"
rs[41] = " هوايه 😍🙈😍"

ws[42] = "يعني شكد"
rs[42] = " فوك متتوقع "

ws[43] = "😂"
rs[43] = " دوم حبي ❤️"

ws[44] = "هههه"
rs[44] = " دوم حبي ❤️"

ws[45] = "ههههه"
rs[45] = " دوم حبي ❤️"

ws[46] = "😹"
rs[46] = " دوم حبي ❤️"

ws[47] = "🌚"
rs[47] = " منور صخام الجدر 🌚🍃"

ws[48] = "😍"
rs[48] = " مح فديتك"

ws[49] = "مح"
rs[49] = " فوديتك❤️"

ws[50] = "انمي"
rs[50] = " اته اوتاكو ؟ ❤️"

ws[51] = "منحرف"
rs[51] = " وينه حطرده 🌚🌚"

ws[52] = "😭"
rs[52] = " 😢😢 لتبجي"

ws[53] = "😢"
rs[53] = "  لتبجي 😭😭"

ws[54] = "شكد عمرك"
rs[54] = "زاحفه 😂😂"

ws[55] = "شكد عمرج"
rs[55] = " زاحف 😂"

ws[56] = "اقرالي دعاء"
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂"

ws[57] = "غبي"
rs[57] = " انته الاغبى"

ws[58] = "دي"
rs[58] = " هاي عود انته جبير 😐😂"

ws[59] = "منو حبيبك"
rs[59] = " اختك 🙈"

ws[60] = "تكرهني"
rs[60] = " يي 😈"

ws[61] = "اكرهك"
rs[61] = " علساس اني احبك تهي بهي 😒🍃"

ws[62] = "😂"
rs[62] = " دوم حبي ❤️"

ws[63] = "الاعضميه"
rs[63] = " احسن ناس وربي❤️"

ws[64] = "الكرادة"
rs[64] = " احسن ناس وربي❤️"

ws[65] = "شارع فلسطين"
rs[65] = " احسن ناس وربي❤️"

ws[66] = "ببكن ملف"
rs[66] = " دي تحلم 😒😒"

ws[67] = "😇"
rs[67] = "  اته مو ملاك اته جهنم بنفسهه 😂"

ws[68] = "😐"
rs[68] = " شبيك صافن 😒🔥"

ws[69] = "انجب"
rs[69] = " وك 😢😞"

ws[70] = "حارة"
rs[70] = "يي كولش 😭🍃🔥"

ws[71] = "خالتك"
rs[71] = " راح اطردك لك 😒"

ws[72] = "اطرد البوت"
rs[72] = " راح ابقة احترمك❤️"

ws[73] = "هه"
rs[73] = " شدتحس"

ws[74] = "شدتحس"
rs[74] = " داحس بيك"

ws[75] = "اكولك"
rs[75] = " لتكول 😐😂"

ws[76] = "اكلك"
rs[76] = " لتكول 😐😂"

ws[78] = "بغداد"
rs[78] = " 😍 فديتهه"

ws[79] = "البصرة"
rs[79] = " احسن ناس وربي❤️"

ws[80] = "تركماني"
rs[80] = " والنعم منك❤️"

ws[81] = "يا سورس هذا"
rs[81] = "ديف بوينت"

ws[83] = "باي"
rs[83] = " بايات ❤️🍃"

ws[84] = "تنح"
rs[84] = "عيب ابني 😒🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "فرخ"
rs[90] = " عيبب 😱😱"

ws[92] = "كسمك"
rs[92] = " عيب 😱😱😱"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " واخيراً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[97] = "حبيبتي"
rs[97] = " منو هاي 😱 تخوني 😔☹"

ws[98] = "كبلت"
rs[98] = " بلخير 😂💔"

ws[99] = "البوت عاوي"
rs[99] = " اطردك ؟ 😒"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " افلش راسك"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		--send_large_msg ( R , rs[i] );
		--send_reply(msg.id, rs[i])
		reply_msg(msg.id, rs[i], ok_cb, false )
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mouamle" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mouamle" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end