--[[
#
#ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#:((
# For More Information ....! 
# Developer : Aziz < @TH3_GHOST > 
# our channel: @DevPointTeam
# Version: 1.1
#:))
#ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#
]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "اوامر3" then
return [[
🔹 اوامر اضافية للمجموعات 🔹
____________________________

/الطقس +لمعرفة الطقس : المنطقة |⛈
/اختصار الرابط  : رابط |🔗
/الاذان +مواقيت الاذان : المنطقة |🕌
/الوقت الان   : لمعرفة الوقت |⏱
/تحويل الى ملصق +تحويل صورة ملصق : بالرد |🚩
/تحويل الى صورة +: تحويل الملصق الى صورة 💡
/اكتبلي +  النص🌈
/كرر البوت يكرر كلامك : كلمات |💬
/ +تحويل النص صوت : كلمات |🔊
/تاك للجميع : شارة لكل الاعضاء : ➕
/اضافة : + المعرف 🌞لاضافة عضو
/مسح + عدد الرسائل 🌚 الامر للمطور فقط 
_____________________________
dev : @body4 🎗
]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"[#!/](اوامر3)"
},
run = run 
}
end
